In [60]:
import pandas as pd

In [3]:
growth = pd.Series([143, 150, 157, 160], index=[
                   "2018", "2019", "2020", "2021"])
growth

2018    143
2019    150
2020    157
2021    160
dtype: int64

In [52]:
growth = pd.Series([143, 150, 157, 160], index=[
                   "2018", "2019", "2020", "2020"],name="Growth")
growth["2020"]
# 딕셔너리와 비슷하지만 키 값과 비슷한 index의 값이 중복되어도 에러가 발생하지 않는 점에서 딕셔너리와 다르다다

2020    157
2020    160
Name: Growth, dtype: int64

In [7]:
growth = pd.Series([143, 150, 157, 160])
growth
growth[0]

143

In [8]:
index = ["2018", "2019", "2020", "2020"]
Yeonghee = pd.Series([143, 150, 157, 160], index=index)
Chelsu = pd.Series([165, 172, 175, 180], index=index)

growth = pd.DataFrame({
    "영희": Yeonghee,
    "철수": Chelsu
})

growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2020  160  180

In [10]:
growth["철수"]

2018    165
2019    172
2020    175
2020    180
Name: 철수, dtype: int64

In [11]:
growth["영희"]

2018    143
2019    150
2020    157
2020    160
Name: 영희, dtype: int64

In [62]:
index = ["2018", "2019", "2020", "2020"]
data = {
    "영희": [143, 150, 157, 160],
    "철수": [165, 172, 175, 180]
}

growth=pd.DataFrame(data,columns=["영희","철수"],index=index)
growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2020  160  180

In [63]:
print(growth.dtypes)

영희    int64
철수    int64
dtype: object

In [64]:
growth.astype("float")

         영희     철수
2018  143.0  165.0
2019  150.0  172.0
2020  157.0  175.0
2020  160.0  180.0

In [65]:
growth.astype({"철수":"float"})

       영희     철수
2018  143  165.0
2019  150  172.0
2020  157  175.0
2020  160  180.0

In [66]:
growth.iloc[0]

영희    143
철수    165
Name: 2018, dtype: int64

In [67]:
growth.iloc[:2,0]

2018    143
2019    150
Name: 영희, dtype: int64

In [68]:
growth.iloc[:2,:2]

       영희   철수
2018  143  165
2019  150  172

In [39]:
read_csv=pd.read_csv(".\\output\\1.csv")
read_csv

    A   B  C
0  10  21  9

In [40]:
read_csv.shape

(1, 3)

In [53]:
read_csv2=pd.read_csv(".\\output\\2.csv",index_col=0)
read_csv2

Empty DataFrame
Columns: []
Index: [0	10	21	9, 100	20	42	18]

In [58]:
# Your code goes here
animals = {'Cows': [12, 20], 'Goats': [22, 19]}
pd.DataFrame(animals).to_csv(".\\output\\cows_and_goats.csv")

In [73]:
growth.loc["2018":"2020"] # 마지막 인덱스도 포함되어 출력력

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2020  160  180

In [74]:
growth.loc["2018":"2020",:"영희"]

       영희
2018  143
2019  150
2020  157
2020  160

In [78]:
growth.iloc[0:3,0:2]

       영희   철수
2018  143  165
2019  150  172
2020  157  175

In [83]:
growth.set_index("철수")

      영희
철수
165  143
172  150
175  157
180  160

In [96]:
growth.loc[(growth.영희 > 150) & (growth.영희=="영희")]  # 조사식식

Empty DataFrame
Columns: [영희, 철수]
Index: []

In [111]:
index = ["영희", "철수", "영철"]
data = {
    "2019": [143, 150, 171],
    "2020": [165, 172, 175],
    "2021": [157, 175, 180]
}

growth = pd.DataFrame(data, columns=["2019","2020","2021"], index=index)
growth

    2019  2020  2021
영희   143   165   157
철수   150   172   175
영철   171   175   180

In [113]:
growth.loc[growth["2019"]>170]

    2019  2020  2021
영철   171   175   180

In [115]:
growth.loc[growth["2019"]==150]

    2019  2020  2021
철수   150   172   175

In [116]:
growth.loc[growth["2019"]==150]

    2019  2020  2021
철수   150   172   175

In [119]:
growth["2019"]=190
print(growth)

    2019  2020  2021
영희   190   165   157
철수   190   172   175
영철   190   175   180

In [121]:
growth["거꾸로"]=range(len(growth),0,-1)
print(growth)

    2019  2020  2021  거꾸로
영희   190   165   157    3
철수   190   172   175    2
영철   190   175   180    1